<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"d10cc30ecc2697c18db4ce1c7e7177af1f96c04d2b40607d787eca29af50805d","plan_job_ref":"Job Pull Request Checks #1984 at https://github.com/GSA-TTS/FAC/actions/runs/7286977381","plan_hash":"aa48bd005524f0edd76a024b1b37ad43e171d6a44fe162486008c62f1c3b6b90","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 8 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.logshipper-network-policy will be created
  + resource "cloudfoundry_network_policy" "logshipper-network-policy" {
      + id = (known after apply)

      + policy {
          + destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = (known after apply)
        }
    }

  # module.staging.cloudfoundry_user_provided_service.credentials will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "credentials" {
      ~ credentials = (sensitive value)
        id          = "6c2d03a3-6eb2-4e4e-9bdb-b1a3b06fc5a8"
        name        = "newrelic-creds"
      ~ tags        = [
          + "newrelic-creds",
        ]
        # (1 unchanged attribute hidden)
    }

  # module.staging.module.cg-logshipper.cloudfoundry_app.cg_logshipper_app will be created
  + resource "cloudfoundry_app" "cg_logshipper_app" {
      + buildpack                       = (known after apply)
      + buildpacks                      = [
          + "https://github.com/cloudfoundry/apt-buildpack",
          + "nginx_buildpack",
        ]
      + disk_quota                      = 256
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "process"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 256
      + name                            = "logshipper"
      + path                            = "../shared/modules/cg-logshipper/logshipper.zip"
      + ports                           = (known after apply)
      + space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 180

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = "6c2d03a3-6eb2-4e4e-9bdb-b1a3b06fc5a8"
        }
      + service_binding {
          + service_instance = (known after apply)
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.staging.module.cg-logshipper.cloudfoundry_route.logshipper will be created
  + resource "cloudfoundry_route" "logshipper" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "fac-staging-logshipper"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.module.cg-logshipper.cloudfoundry_user_provided_service.logdrain_service will be created
  + resource "cloudfoundry_user_provided_service" "logdrain_service" {
      + id               = (known after apply)
      + name             = "fac-logdrain"
      + space            = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + syslog_drain_url = (sensitive value)
    }

  # module.staging.module.cg-logshipper.cloudfoundry_user_provided_service.logshipper_creds will be created
  + resource "cloudfoundry_user_provided_service" "logshipper_creds" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "cg-logshipper-creds"
      + space       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + tags        = [
          + "logshipper-creds",
        ]
    }

  # module.staging.module.cg-logshipper.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.staging.module.cg-logshipper.random_uuid.username will be created
  + resource "random_uuid" "username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.staging.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket will be created
  + resource "cloudfoundry_service_instance" "bucket" {
      + id                             = (known after apply)
      + name                           = "log-storage"
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
      + space                          = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
      + tags                           = [
          + "logshipper-s3",
        ]
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.staging.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/staging.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 5 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #1984](https://github.com/GSA-TTS/FAC/actions/runs/7286977381)